test/benchmark/tests/package-size/package-size-0-executor-poolmgr/raw-usage.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /   
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=raw-1.json
     script: ../sample.js

    duration: 5s, iterations: -
         vus: 1,  max: 1

    init [----------------------------------------------------------] starting
    ✓ status is 200

    checks.....................: 100.00% ✓ 5   ✗ 0  
    data_received..............: 840 B   167 B/s
    data_sent..................: 550 B   109 B/s
    http_req_blocked...........: avg=663.37µs min=527.19µs med=639.26µs max=947.4µs  p(5)=531.57µs p(10)=535.95µs p(15)=540.33µs p(20)=544.71µs p(25)=549.09µs p(30)=567.12µs p(35)=585.16µs p(40)=603.19µs p(45)=621.22µs p(50)=639.26µs p(55)=642.19µs p(60)=645.12µs p(65)=648.05µs p(70)=650.98µs p(75)=653.91µs p(80)=712.6µs  p(85)=771.3µs  p(90)=830µs    p(95)=888.7µs  p(100)=947.4µs 
    http_req_connecting........: avg=602.37µs min=474.71µs med=574.29µs max=893.84µs p(5)=477µs    p(10)=479.28µs p(15)=481.57µs p(20)=483.86µs p(25)=486.14µs p(30)=503.77µs p(35)=521.4µs  p(40)=539.03µs p(45)=556.66µs p(50)=574.29µs p(55)=576.01µs p(60)=577.72µs p(65)=579.44µs p(70)=581.16µs p(75)=582.88µs p(80)=645.07µs p(85)=707.27µs p(90)=769.46µs p(95)=831.65µs p(100)=893.84µs
    http_req_duration..........: avg=30.54ms  min=2.19ms   med=2.54ms   max=141.69ms p(5)=2.21ms   p(10)=2.22ms   p(15)=2.24ms   p(20)=2.25ms   p(25)=2.27ms   p(30)=2.32ms   p(35)=2.38ms   p(40)=2.43ms   p(45)=2.48ms   p(50)=2.54ms   p(55)=2.83ms   p(60)=3.12ms   p(65)=3.41ms   p(70)=3.7ms    p(75)=3.99ms   p(80)=31.53ms  p(85)=59.07ms  p(90)=86.61ms  p(95)=114.15ms p(100)=141.69ms
    http_req_receiving.........: avg=61.85µs  min=47.5µs   med=57.03µs  max=89.21µs  p(5)=49µs     p(10)=50.49µs  p(15)=51.98µs  p(20)=53.48µs  p(25)=54.97µs  p(30)=55.38µs  p(35)=55.79µs  p(40)=56.21µs  p(45)=56.62µs  p(50)=57.03µs  p(55)=57.73µs  p(60)=58.43µs  p(65)=59.13µs  p(70)=59.83µs  p(75)=60.53µs  p(80)=66.26µs  p(85)=72µs     p(90)=77.74µs  p(95)=83.47µs  p(100)=89.21µs 
    http_req_sending...........: avg=56.56µs  min=38.75µs  med=41.53µs  max=109.43µs p(5)=38.95µs  p(10)=39.15µs  p(15)=39.35µs  p(20)=39.55µs  p(25)=39.75µs  p(30)=40.11µs  p(35)=40.46µs  p(40)=40.82µs  p(45)=41.18µs  p(50)=41.53µs  p(55)=43.89µs  p(60)=46.25µs  p(65)=48.6µs   p(70)=50.96µs  p(75)=53.32µs  p(80)=64.54µs  p(85)=75.76µs  p(90)=86.99µs  p(95)=98.21µs  p(100)=109.43µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(5)=0s       p(10)=0s       p(15)=0s       p(20)=0s       p(25)=0s       p(30)=0s       p(35)=0s       p(40)=0s       p(45)=0s       p(50)=0s       p(55)=0s       p(60)=0s       p(65)=0s       p(70)=0s       p(75)=0s       p(80)=0s       p(85)=0s       p(90)=0s       p(95)=0s       p(100)=0s      
    http_req_waiting...........: avg=30.42ms  min=2.1ms    med=2.44ms   max=141.49ms p(5)=2.12ms   p(10)=2.13ms   p(15)=2.14ms   p(20)=2.16ms   p(25)=2.17ms   p(30)=2.22ms   p(35)=2.28ms   p(40)=2.33ms   p(45)=2.39ms   p(50)=2.44ms   p(55)=2.73ms   p(60)=3.02ms   p(65)=3.3ms    p(70)=3.59ms   p(75)=3.88ms   p(80)=31.4ms   p(85)=58.92ms  p(90)=86.45ms  p(95)=113.97ms p(100)=141.49ms
    http_reqs..................: 5       0.999955/s
    iteration_duration.........: avg=800.86ms min=142.65ms med=999.56ms max=1s       p(5)=286.43ms p(10)=430.21ms p(15)=573.98ms p(20)=717.76ms p(25)=861.54ms p(30)=889.15ms p(35)=916.75ms p(40)=944.35ms p(45)=971.95ms p(50)=999.56ms p(55)=999.67ms p(60)=999.79ms p(65)=999.9ms  p(70)=1s       p(75)=1s       p(80)=1s       p(85)=1s       p(90)=1s       p(95)=1s       p(100)=1s      
    iterations.................: 5       0.999955/s
    vus........................: 1       min=1 max=1
    vus_max....................: 1       min=1 max=1


          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /   
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=raw-2.json
     script: ../sample.js

    duration: 5s, iterations: -
         vus: 1,  max: 1

    init [----------------------------------------------------------] starting
    ✓ status is 200

    checks.....................: 100.00% ✓ 5   ✗ 0  
    data_received..............: 840 B   167 B/s
    data_sent..................: 550 B   109 B/s
    http_req_blocked...........: avg=570.57µs min=496.07µs med=586.74µs max=629.51µs p(5)=507.11µs p(10)=518.15µs p(15)=529.18µs p(20)=540.22µs p(25)=551.26µs p(30)=558.35µs p(35)=565.45µs p(40)=572.55µs p(45)=579.64µs p(50)=586.74µs p(55)=587.24µs p(60)=587.75µs p(65)=588.25µs p(70)=588.76µs p(75)=589.27µs p(80)=597.31µs p(85)=605.36µs p(90)=613.41µs p(95)=621.46µs p(100)=629.51µs
    http_req_connecting........: avg=516.02µs min=435.68µs med=535.18µs max=573.62µs p(5)=448.4µs  p(10)=461.12µs p(15)=473.83µs p(20)=486.55µs p(25)=499.27µs p(30)=506.45µs p(35)=513.63µs p(40)=520.82µs p(45)=528µs    p(50)=535.18µs p(55)=535.41µs p(60)=535.64µs p(65)=535.87µs p(70)=536.1µs  p(75)=536.33µs p(80)=543.78µs p(85)=551.24µs p(90)=558.7µs  p(95)=566.16µs p(100)=573.62µs
    http_req_duration..........: avg=33.24ms  min=1.99ms   med=2.11ms   max=157.15ms p(5)=2ms      p(10)=2.01ms   p(15)=2.02ms   p(20)=2.03ms   p(25)=2.04ms   p(30)=2.06ms   p(35)=2.07ms   p(40)=2.08ms   p(45)=2.09ms   p(50)=2.11ms   p(55)=2.26ms   p(60)=2.42ms   p(65)=2.58ms   p(70)=2.73ms   p(75)=2.89ms   p(80)=33.74ms  p(85)=64.59ms  p(90)=95.44ms  p(95)=126.29ms p(100)=157.15ms
    http_req_receiving.........: avg=52.97µs  min=36.15µs  med=51.1µs   max=68.79µs  p(5)=37.85µs  p(10)=39.55µs  p(15)=41.25µs  p(20)=42.95µs  p(25)=44.65µs  p(30)=45.94µs  p(35)=47.23µs  p(40)=48.52µs  p(45)=49.81µs  p(50)=51.1µs   p(55)=53.71µs  p(60)=56.32µs  p(65)=58.93µs  p(70)=61.54µs  p(75)=64.15µs  p(80)=65.07µs  p(85)=66µs     p(90)=66.93µs  p(95)=67.86µs  p(100)=68.79µs 
    http_req_sending...........: avg=47.45µs  min=39.35µs  med=45.73µs  max=62.18µs  p(5)=40.25µs  p(10)=41.15µs  p(15)=42.05µs  p(20)=42.96µs  p(25)=43.86µs  p(30)=44.23µs  p(35)=44.61µs  p(40)=44.98µs  p(45)=45.36µs  p(50)=45.73µs  p(55)=45.82µs  p(60)=45.9µs   p(65)=45.98µs  p(70)=46.07µs  p(75)=46.15µs  p(80)=49.36µs  p(85)=52.56µs  p(90)=55.77µs  p(95)=58.97µs  p(100)=62.18µs 
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(5)=0s       p(10)=0s       p(15)=0s       p(20)=0s       p(25)=0s       p(30)=0s       p(35)=0s       p(40)=0s       p(45)=0s       p(50)=0s       p(55)=0s       p(60)=0s       p(65)=0s       p(70)=0s       p(75)=0s       p(80)=0s       p(85)=0s       p(90)=0s       p(95)=0s       p(100)=0s      
    http_req_waiting...........: avg=33.14ms  min=1.9ms    med=2.03ms   max=157.02ms p(5)=1.91ms   p(10)=1.92ms   p(15)=1.93ms   p(20)=1.94ms   p(25)=1.95ms   p(30)=1.97ms   p(35)=1.98ms   p(40)=2ms      p(45)=2.01ms   p(50)=2.03ms   p(55)=2.18ms   p(60)=2.33ms   p(65)=2.48ms   p(70)=2.63ms   p(75)=2.78ms   p(80)=33.63ms  p(85)=64.48ms  p(90)=95.32ms  p(95)=126.17ms p(100)=157.02ms
    http_reqs..................: 5       0.999958/s
    iteration_duration.........: avg=800.55ms min=158.05ms med=999.18ms max=1s       p(5)=295.56ms p(10)=433.06ms p(15)=570.57ms p(20)=708.08ms p(25)=845.58ms p(30)=876.3ms  p(35)=907.02ms p(40)=937.74ms p(45)=968.46ms p(50)=999.18ms p(55)=999.31ms p(60)=999.44ms p(65)=999.57ms p(70)=999.71ms p(75)=999.84ms p(80)=999.9ms  p(85)=999.95ms p(90)=1s       p(95)=1s       p(100)=1s      
    iterations.................: 5       0.999958/s
    vus........................: 1       min=1 max=1
    vus_max....................: 1       min=1 max=1


          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /   
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=raw-3.json
     script: ../sample.js

    duration: 5s, iterations: -
         vus: 1,  max: 1

    init [----------------------------------------------------------] starting
    ✓ status is 200

    checks.....................: 100.00% ✓ 5   ✗ 0  
    data_received..............: 840 B   167 B/s
    data_sent..................: 550 B   109 B/s
    http_req_blocked...........: avg=667.55µs min=585.45µs med=640.27µs max=787.93µs p(5)=595.83µs p(10)=606.22µs p(15)=616.61µs p(20)=626.99µs p(25)=637.38µs p(30)=637.96µs p(35)=638.54µs p(40)=639.11µs p(45)=639.69µs p(50)=640.27µs p(55)=649.56µs p(60)=658.85µs p(65)=668.13µs p(70)=677.42µs p(75)=686.71µs p(80)=706.95µs p(85)=727.2µs  p(90)=747.44µs p(95)=767.69µs p(100)=787.93µs
    http_req_connecting........: avg=596.49µs min=523.73µs med=569.64µs max=702.89µs p(5)=532.5µs  p(10)=541.27µs p(15)=550.04µs p(20)=558.81µs p(25)=567.58µs p(30)=567.99µs p(35)=568.4µs  p(40)=568.81µs p(45)=569.23µs p(50)=569.64µs p(55)=579.44µs p(60)=589.23µs p(65)=599.03µs p(70)=608.83µs p(75)=618.63µs p(80)=635.48µs p(85)=652.33µs p(90)=669.19µs p(95)=686.04µs p(100)=702.89µs
    http_req_duration..........: avg=27.17ms  min=2.29ms   med=2.61ms   max=125.66ms p(5)=2.29ms   p(10)=2.3ms    p(15)=2.3ms    p(20)=2.3ms    p(25)=2.3ms    p(30)=2.36ms   p(35)=2.43ms   p(40)=2.49ms   p(45)=2.55ms   p(50)=2.61ms   p(55)=2.69ms   p(60)=2.76ms   p(65)=2.84ms   p(70)=2.91ms   p(75)=2.99ms   p(80)=27.52ms  p(85)=52.05ms  p(90)=76.59ms  p(95)=101.12ms p(100)=125.66ms
    http_req_receiving.........: avg=69.31µs  min=36.29µs  med=60.6µs   max=133.6µs  p(5)=38.04µs  p(10)=39.79µs  p(15)=41.54µs  p(20)=43.29µs  p(25)=45.04µs  p(30)=48.15µs  p(35)=51.27µs  p(40)=54.38µs  p(45)=57.49µs  p(50)=60.6µs   p(55)=62.68µs  p(60)=64.76µs  p(65)=66.84µs  p(70)=68.92µs  p(75)=70.99µs  p(80)=83.52µs  p(85)=96.04µs  p(90)=108.56µs p(95)=121.08µs p(100)=133.6µs 
    http_req_sending...........: avg=63.22µs  min=40.31µs  med=48.25µs  max=132.06µs p(5)=40.97µs  p(10)=41.63µs  p(15)=42.29µs  p(20)=42.95µs  p(25)=43.62µs  p(30)=44.54µs  p(35)=45.47µs  p(40)=46.39µs  p(45)=47.32µs  p(50)=48.25µs  p(55)=48.98µs  p(60)=49.7µs   p(65)=50.43µs  p(70)=51.16µs  p(75)=51.89µs  p(80)=67.92µs  p(85)=83.96µs  p(90)=99.99µs  p(95)=116.02µs p(100)=132.06µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(5)=0s       p(10)=0s       p(15)=0s       p(20)=0s       p(25)=0s       p(30)=0s       p(35)=0s       p(40)=0s       p(45)=0s       p(50)=0s       p(55)=0s       p(60)=0s       p(65)=0s       p(70)=0s       p(75)=0s       p(80)=0s       p(85)=0s       p(90)=0s       p(95)=0s       p(100)=0s      
    http_req_waiting...........: avg=27.04ms  min=2.21ms   med=2.49ms   max=125.39ms p(5)=2.21ms   p(10)=2.21ms   p(15)=2.21ms   p(20)=2.21ms   p(25)=2.22ms   p(30)=2.27ms   p(35)=2.32ms   p(40)=2.38ms   p(45)=2.43ms   p(50)=2.49ms   p(55)=2.57ms   p(60)=2.65ms   p(65)=2.72ms   p(70)=2.8ms    p(75)=2.88ms   p(80)=27.38ms  p(85)=51.89ms  p(90)=76.39ms  p(95)=100.89ms p(100)=125.39ms
    http_reqs..................: 5       0.999956/s
    iteration_duration.........: avg=800.71ms min=126.7ms  med=997.83ms max=1s       p(5)=277.42ms p(10)=428.13ms p(15)=578.85ms p(20)=729.56ms p(25)=880.28ms p(30)=903.79ms p(35)=927.3ms  p(40)=950.81ms p(45)=974.32ms p(50)=997.83ms p(55)=997.85ms p(60)=997.87ms p(65)=997.89ms p(70)=997.91ms p(75)=997.93ms p(80)=998.51ms p(85)=999.08ms p(90)=999.66ms p(95)=1s       p(100)=1s      
    iterations.................: 5       0.999956/s
    vus........................: 1       min=1 max=1
    vus_max....................: 1       min=1 max=1


          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /   
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=raw-4.json
     script: ../sample.js

    duration: 5s, iterations: -
         vus: 1,  max: 1

    init [----------------------------------------------------------] starting
    ✓ status is 200

    checks.....................: 100.00% ✓ 5   ✗ 0  
    data_received..............: 840 B   167 B/s
    data_sent..................: 550 B   109 B/s
    http_req_blocked...........: avg=613.39µs min=548.21µs med=607.12µs max=676.82µs p(5)=559.34µs p(10)=570.47µs p(15)=581.6µs  p(20)=592.73µs p(25)=603.87µs p(30)=604.52µs p(35)=605.17µs p(40)=605.82µs p(45)=606.47µs p(50)=607.12µs p(55)=611.88µs p(60)=616.65µs p(65)=621.41µs p(70)=626.17µs p(75)=630.94µs p(80)=640.12µs p(85)=649.29µs p(90)=658.47µs p(95)=667.65µs p(100)=676.82µs
    http_req_connecting........: avg=545.67µs min=498.88µs med=544.12µs max=600.39µs p(5)=506.24µs p(10)=513.6µs  p(15)=520.96µs p(20)=528.32µs p(25)=535.68µs p(30)=537.37µs p(35)=539.06µs p(40)=540.74µs p(45)=542.43µs p(50)=544.12µs p(55)=545.15µs p(60)=546.19µs p(65)=547.23µs p(70)=548.27µs p(75)=549.3µs  p(80)=559.52µs p(85)=569.74µs p(90)=579.96µs p(95)=590.17µs p(100)=600.39µs
    http_req_duration..........: avg=29.92ms  min=2.01ms   med=5.67ms   max=128.83ms p(5)=2.3ms    p(10)=2.59ms   p(15)=2.88ms   p(20)=3.18ms   p(25)=3.47ms   p(30)=3.91ms   p(35)=4.35ms   p(40)=4.79ms   p(45)=5.23ms   p(50)=5.67ms   p(55)=6.46ms   p(60)=7.24ms   p(65)=8.03ms   p(70)=8.82ms   p(75)=9.6ms    p(80)=33.45ms  p(85)=57.3ms   p(90)=81.14ms  p(95)=104.99ms p(100)=128.83ms
    http_req_receiving.........: avg=66.08µs  min=39.59µs  med=45.71µs  max=130.61µs p(5)=39.77µs  p(10)=39.95µs  p(15)=40.13µs  p(20)=40.31µs  p(25)=40.48µs  p(30)=41.53µs  p(35)=42.57µs  p(40)=43.62µs  p(45)=44.67µs  p(50)=45.71µs  p(55)=51.37µs  p(60)=57.03µs  p(65)=62.69µs  p(70)=68.35µs  p(75)=74.01µs  p(80)=85.33µs  p(85)=96.65µs  p(90)=107.97µs p(95)=119.29µs p(100)=130.61µs
    http_req_sending...........: avg=56.25µs  min=40.54µs  med=46.8µs   max=102.61µs p(5)=40.84µs  p(10)=41.13µs  p(15)=41.42µs  p(20)=41.72µs  p(25)=42.01µs  p(30)=42.97µs  p(35)=43.93µs  p(40)=44.88µs  p(45)=45.84µs  p(50)=46.8µs   p(55)=47.3µs   p(60)=47.8µs   p(65)=48.31µs  p(70)=48.81µs  p(75)=49.31µs  p(80)=59.97µs  p(85)=70.63µs  p(90)=81.29µs  p(95)=91.95µs  p(100)=102.61µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(5)=0s       p(10)=0s       p(15)=0s       p(20)=0s       p(25)=0s       p(30)=0s       p(35)=0s       p(40)=0s       p(45)=0s       p(50)=0s       p(55)=0s       p(60)=0s       p(65)=0s       p(70)=0s       p(75)=0s       p(80)=0s       p(85)=0s       p(90)=0s       p(95)=0s       p(100)=0s      
    http_req_waiting...........: avg=29.79ms  min=1.92ms   med=5.58ms   max=128.6ms  p(5)=2.21ms   p(10)=2.51ms   p(15)=2.8ms    p(20)=3.09ms   p(25)=3.39ms   p(30)=3.82ms   p(35)=4.26ms   p(40)=4.7ms    p(45)=5.14ms   p(50)=5.58ms   p(55)=6.36ms   p(60)=7.14ms   p(65)=7.92ms   p(70)=8.71ms   p(75)=9.49ms   p(80)=33.31ms  p(85)=57.13ms  p(90)=80.96ms  p(95)=104.78ms p(100)=128.6ms 
    http_reqs..................: 5       0.999949/s
    iteration_duration.........: avg=802.5ms  min=129.82ms med=999.25ms max=1s       p(5)=279.35ms p(10)=428.88ms p(15)=578.41ms p(20)=727.94ms p(25)=877.47ms p(30)=901.82ms p(35)=926.18ms p(40)=950.53ms p(45)=974.89ms p(50)=999.25ms p(55)=999.25ms p(60)=999.26ms p(65)=999.27ms p(70)=999.28ms p(75)=999.28ms p(80)=1s       p(85)=1s       p(90)=1s       p(95)=1s       p(100)=1s      
    iterations.................: 5       0.999949/s
    vus........................: 1       min=1 max=1
    vus_max....................: 1       min=1 max=1